app/controllers/calculations_controller.rb

INSERT INTO "calculations" ("result", "equation", "created_at", "updated_at") VALUES(7, '3+4', '2011-04-22 14:48:24.084325', '2011-04-22 14:48:24.084325') RETURNING "id"
---
  def create
    @calculation = Calculation.new(params[:calculation])
    @calculation.result = eval(@calculation.equation)
    @calculation.save

SELECT * FROM "calculations" WHERE ("calculations"."id" = 1)
SELECT * FROM "calculations"
---
  def show
    @calculation = Calculation.find(params[:id])
    @calculations = Calculation.all